[
  {
    "title":"Afreximbank Unveils $1 Billion Fund to Boost Africa&#8217;s Film Industry",
    "excerpt":"The African Export-Import Bank (Afreximbank) has announced plans for a $1 billion African Film Fund to support and finance the continent’s film sector. Kanayo Awani, Afreximbank’s Executive Vice President, revealed the fund at the 2023 CANEX Summit during the third Intra-African Trade Fair (IATF2023). She stated the fund will oversee film financing, co-finance major studio ",
    "articleContent":"The African Export-Import Bank (Afreximbank) has announced plans for a $1 billion African Film Fund to support and finance the continent’s film sector.
Kanayo Awani, Afreximbank’s Executive Vice President, revealed the fund at the 2023 CANEX Summit during the third Intra-African Trade Fair (IATF2023). She stated the fund will oversee film financing, co-finance major studio projects, back African filmmakers, and finance producers and directors across Africa.
During CANEX 2022, Afreximbank increased its creative sector financing from $500 million to $1 billion. It currently has a pipeline of over $600 million in deals across film, music, visual arts, fashion and sports. The first film financed by Afreximbank recently premiered at the Toronto Film Festival. Several Nigerian, South African and Kenyan films are slated for streaming release in 2024.
Despite Africa’s $5 billion film industry employing 5 million people and having $20 billion revenue potential annually, the sector faces challenges. These include limited financing access and weak copyright laws enabling piracy. Lack of infrastructure, skills, and market access also constrain growth. Consequently, African creative products struggle to gain international exposure and distribution.
The CANEX program provides financial and non-financial support to facilitate trade and investment in Africa’s creative industries. The week-long CANEX Summit fosters discussions and partnerships between businesses and governments. It features a fashion show with African designs and a music factory where artists can record their work.
Actor Boris Kodjoe noted that while black creativity has inspired music, art, business and film globally, Africa still battles external perceptions of poverty and conflict fueled by media depictions. Yet, culturally-specific content is in high demand worldwide, and Africa is a key provider given its young, connected population. Afrobeat music is already going global, and by 2030, Africa could generate $200 billion in creative exports.
AU Commissioner Albert Muchanga reaffirmed the fast-growing creative sector’s immense potential for African job creation and economic growth. However, he stressed that potential must convert into concrete plans and projects, with investments in protecting intellectual property rights.
With the new billion-dollar film fund, Afreximbank can directly empower African filmmakers and studios to tell their stories for global audiences. Financing and distribution support will alleviate key constraints, nurturing the sector’s development.
The fund’s impact will also extend beyond the film industry to stimulate broader economic activity. As film production increases, it will drive job creation, infrastructure expansion, tourism and exports.
By spotlighting promising African talents, the fund can help shift external narratives too. Showcasing Africa’s diversity and creativity on the big screen challenges outdated perceptions.
Ultimately, Afreximbank’s African Film Fund investment recognizes the sector’s enormous social and economic potential. It will spur cultural and financial gains as Africa’s vibrant voices reach the global stage.
Source
",
"resources":"",
"featured_image":"https://www.techinafrica.com/wp-content/uploads/2023/11/photo-1599999904008-5e6c46408412.jpeg.jpg",

  }
]